aspell-en
autoconf
automake
bash
bind-tools
bluez
bluez-firmware
bluez-utils
chromium
clipster
coreutils
cryptsetup
device-mapper
dmenu
dunst
emacs
feh
firefox-developer
gawk
gcc
git
gnu-netcat
htop
httpie
ipython
jq
light
linux
make
mu
mupdf
neovim
netctl
nextcloud-client
nginx
nmap
ntp
offlineimap
openssh
openvpn
pacman
pass
pavucontrol
perl
python-pip
rsync
rofi
rtorrent
sed
spotify
stumpwm-git
sudo
tar
terminus-font
termite
the_silver_searcher
thunar
tint2
tk
tmux
traceroute
trash-cli
tree
unzip
words
wpa_supplicant
yaourt
yarn
